## guest

```text
Если гость нажимает кнопку "Войти" без ввода логина и пароля, то он остается на странице /login 
и видит сообщение об ошибке с кодом "VALIDATION" и текстом "Логин и пароль обязательны"
```

```text
Если гость вводит логин, которого нет в системе, то он остается на странице /login 
и видит сообщение об ошибке с кодом "UNAUTHORIZED"
```

```text
Если гость входит на страницу /catalog, то его перенаправляет на страницу /login?from=%2Fcatalog
```

```text
Если гость входит на страницу /admin/products, то его перенаправляет на страницу /login?from=%2Fadmin%2Fproducts
```

```text
Если гость входит на страницу /profile, то его перенаправляет на страницу /login?from=%2Fprofile
```
______________________________________________________________________________________________________



## user
```text
Если пользователь вводит верный пароль, 
то он попадает /catalog с колонками:
 - Название
 - категория
 - цена
 - остаток
 И следующими полями в шапке:
 - кнопка "Выйти"
 - кнопка "катлог"
 - кнопка "профиль"
 - роль "user"
 Служебные поля: 
 - поиск по названию товара
 - фильтр по категории: (все категории, бумаги, ручки, тетради, прочее)
 - сортировка (имени, цене, остатку)
```

```text
Если пользователь вводит неверный пароль, то он остается на странице /login 
и видит сообщение об ошибке с кодом "UNAUTHORIZED"
```

```text
Если пользователь нажимает кнопку "Войти" без ввода пароля, то он остается на странице /login
и видит сообщение об ошибке с кодом "VALIDATION" и текстом "Логин и пароль обязательны"
```

```text
Если пользователь со страницы /catalog пытается перейти на страницу /admin/products, 
то он видит сообщение об ошибке с кодом "403" и текстом "Недостаточно прав для доступа к этой странице"
```

```text
Если пользователь нажимает кнопку "Выйти", то он выходит из системы и попадает на страницу /login
```
______________________________________________________________________________________________________

## admin

```text
Если администратор вводит верный пароль, то он попадает /catalog 
аналогично пользователю, но со следующими отличиями:
 - роль "admin"
 - добавлена кнопка "товары"
 - добавлена колонка в таблице товаров "изменить"
```
______________________________________________________________________________________________________


## blocked

```text
Если пользователь заблокирован, то при попытке входа в систему он остается на странице /login
и видит сообщение об ошибке с кодом "BLOCKED" и текстом "Учётная запись заблокирована"
```
